#include <stdio.h>

int main() {
    int x = 12, y = 7, z = 12;       // กำหนดค่าให้ตัวแปร

    printf("1. x > y               = %d\n", x > y);        // ตรวจว่า x มากกว่า y 
    printf("2. x < z               = %d\n", x < z);        // ตรวจว่า x น้อยกว่า z 
    printf("3. x == z              = %d\n", x == z);       // ตรวจว่า x เท่ากับ z
    printf("4. x != y              = %d\n", x != y);       // ตรวจว่า x ไม่เท่ากับ y
    printf("5. !(2*5 >= y) || (5 != (5/3)) = %d\n", !(2*5 >= y) || (5 != (5/3)));  //คำนวณทั้งสองฝั่งหา จริง → เท็จ || จริง = จริง
    printf("6. !(x < y)            = %d\n", !(x < y));                    // ตรวจว่า x ไม่ได้น้อยกว่า y
    printf("7. (x + y) > (z * 2)   = %d\n", (x + y) > (z * 2));           // ตรวจว่า x+y มากกว่า z*2 ไหม
    printf("8. (x %% 2 == 0) || (y %% 2 == 1) = %d\n", (x % 2 == 0) || (y % 2 == 1));  //คำนวณทั้งสองฝั่งหา จริง กับ เท็จ
    printf("9. (x > y) && (z < y)  = %d\n", (x > y) && (z < y));       // ตรวจว่า x มากกว่า y และ z น้อยกว่า y หรือไม่

    return 0;
}
