#include <stdio.h>

int main() {
    int A, B, C, D, E, F, G;
    A = -2 + 5 * 2;  // คูณก่อน บวกทีหลัง
    B = 10 / 2 * 3;  // หารก่อนคูณทีหลัง
    C = 6 / 2 + 3 * (4 % 2);  // (คำนวณในวง)หารก่อนบวกและคูณ 
    D = (5 + 2) * 15 % 4;  // บวกในวงเล็บก่อน คูณก่อน และหาร
    E = 6 + 2 * 2 - 6 / 2;  // คูณและหารก่อน บวกและลบทีหลัง
    F = 5 + 3 * 2 - 8 / 4 + (6 % 5);  // คูณหารก่อน บวกลบทีหลัง
    G = (4 + 3) * 2 - 10 / (2 + 3);  // บวกในวงเล็บก่อน คูณและหารก่อนลบ

    // แสดงผลลัพธ์ทั้งหมด
    printf("A = %d\n", A);
    printf("B = %d\n", B);
    printf("C = %d\n", C);
    printf("D = %d\n", D);
    printf("E = %d\n", E);
    printf("F = %d\n", F);
    printf("G = %d\n", G);

    return 0;
}

